Repository: juli3nj/klean
Catalog: public/content/plugins/business-reviews-bundle/languages/brb-*.po
Languages: ja_ja, lt_lt, ro_ro

source: %s Rating
ja_ja: %s 評価
ro_ro: Evaluare %s

source: See all reviews
ja_ja: すべてのクチコミを見る
lt_lt: Matyti visus įvertinimus
ro_ro: Vezi Toate Recenziile

source: Google User
ja_ja: Google ユーザー
lt_lt: Google vartotojas

source: read more
ja_ja: もっと読む
lt_lt: skaityti daugiau
ro_ro: mai mult

source: Next Reviews
ja_ja: 次のクチコミ
lt_lt: Daugiau įvertinimų
ro_ro: Următoarele Recenzii

source: Based on %s reviews
ja_ja: %sレビューの平均
lt_lt: Pateikta %s įvertinimų
ro_ro: Bazat pe %s de Recenzii

source: Based on %s reviews from
ja_ja: %sレビューの平均
lt_lt: Pateikta %s įvertinimų iš
ro_ro: Bazat pe %s recenzii din

source: review us on
ja_ja: にクチコミを書く
lt_lt: peržiūrėti vertinimus
ro_ro: evaluați-ne pe

source: just left us a %s star review
ja_ja: %sさんが今ちょうど～スターレビューを投稿しました
lt_lt: ką tik mums %s žvaigždučių apžvalgą
ro_ro: ne-ați lăsat o recenzie cu %s stele

source: on
ja_ja: の上
ro_ro: pe

source: Excellent
ja_ja: 素晴らしい
lt_lt: Puikiai
ro_ro: Excelent

source: Great
ja_ja: より大きな
lt_lt: Labai gerai
ro_ro: Foarte bun

source: Good
ja_ja: 良い
lt_lt: Gerai
ro_ro: Bun

source: Fair
ja_ja: 公平
lt_lt: Patenkinamai
ro_ro: Acceptabil

source: Poor
ja_ja: 貧しい
lt_lt: Silpnai
ro_ro: Slab

source: %s Reitingas
lt_lt: Valoración en %s

source: Write a review
lt_lt: Escribir un comentario
ro_ro: Scrie o Recenzie
